/*1952339 信08 张馨月*/
#include<iostream>
#include<cstdio>
using namespace std;

int main()
{
	cout << "请输入年，月，日\n";
	int y, m, d;
	cin >> y >> m >> d;
	if (m > 12) {
		cout << "输入错误-月份不正确\n";
		return 0;
	}
	if (m != 2) {
		if ((m & 1) && d > 31) {
			cout << "输入错误-日与月的关系非法\n";
			return 0;
		}
		else if ((m & 1) == 0 && d > 30) {
			cout << "输入错误-日与月的关系非法\n";
			return 0;
		}
	}
	if ((y % 400 == 0) || (y % 4 == 0 && y % 100)) {
		if (m == 2) {
			if (d >= 29)
				cout << "输入错误-日与月的关系非法\n";
			else
				cout << y << '-' << m << '-' << d << "是" << y << "年的第" << 31 + d << "天\n";
		}
		else if (m == 1)
			cout << y << '-' << m << '-' << d << "是" << y << "年的第" << d << "天\n";
		else if (m <= 7) {
			if (m & 1)
				cout << y << '-' << m << '-' << d << "是" << y << "年的第" << (m >> 1) * 61 - 1 + d << "天\n";
			else
				cout << y << '-' << m << '-' << d << "是" << y << "年的第" << (m >> 1) * 61 - 1 - 30 + d << "天\n";
		}
		else {
			if (m & 1)
				cout << y << '-' << m << '-' << d << "是" << y << "年的第" << 212 + ((m - 7) >> 1) * 61 - 1 + d << "天\n";
			else
				cout << y << '-' << m << '-' << d << "是" << y << "年的第" << 212 + ((m - 7) >> 1) * 61 - 1 - 30 + d << "天\n";
		}
	}
	else {
		if (m == 1)
			cout << y << '-' << m << '-' << d << "是" << y << "年的第" << d << "天\n";
		else if (m == 2) {
			if (d >= 29)
				cout << "输入错误-日与月的关系非法\n";
			else
				cout << y << '-' << m << '-' << d << "是" << y << "年的第" << 31 + d << "天\n";
		}
		else if (m <= 7) {
			if (m & 1)
				cout << y << '-' << m << '-' << d << "是" << y << "年的第" << (m >> 1) * 61 - 2 + d << "天\n";
			else
				cout << y << '-' << m << '-' << d << "是" << y << "年的第" << (m >> 1) * 61 - 2 - 30 + d << "天\n";
		}
		else {
			if (m & 1)
				cout << y << '-' << m << '-' << d << "是" << y << "年的第" << 212 + ((m - 7) >> 1) * 61 - 30 + d << "天\n";
			else
				cout << y << '-' << m << '-' << d << "是" << y << "年的第" << 212 + ((m - 7) >> 1) * 61 + d << "天\n";
		}
	}
	return 0;
}