/*1952339 信08 张馨月*/
#include <iostream>
using namespace std;

/* 函数外不准添加任何内容*/

/***************************************************************************
  函数名称：max
  功    能：求两数最大值
  输入参数：a,b
  返 回 值：较大值
  说    明：无
***************************************************************************/
int max2(int a, int b)
{
	/* 本函数不准改动 */
	return  (a > b ? a : b);
}

/***************************************************************************
  函数名称：max4
  功    能：求四数最大值
  输入参数：a,b,c,d
  返 回 值：最大值
  说    明：无
***************************************************************************/
int max4(int a, int b, int c, int d)
{
	/* 1、通过多次调用max2实现，本函数内不准使用
			任何if形式
			switch-case
			关系运算符
			逻辑运算符
			bool型变量
			条件运算符
	   2、可定义0~3个整型变量 */
	return max2(a, max2(b, max2(c, d))); //本句可按需修改
}

/***************************************************************************
  函数名称：main
  功    能：main函数
  输入参数：无
  返 回 值：无
  说    明：无
***************************************************************************/
int main()
{
	/* 本函数不准有任何改动 */
	int a, b, c, d, m;

	cout << "请输入4个整数 : " << endl;
	cin >> a >> b >> c >> d;  //不考虑输入错误

	m = max4(a, b, c, d);
	cout << "max=" << m << endl;

	return 0;
}
