/*1952339 信08 张馨月*/
#include <iostream>
#include <iomanip>
#include <cmath>
using namespace std;

/***************************************************************************
  函数名称：prime
  功    能：判断n是否为素数
  输入参数：n
  返 回 值：0 - 不是素数
			1 - 是素数
  说    明：本函数要求与4-7.cpp中的prime函数实现完全一致!!!
***************************************************************************/
int prime(int n)
{
	int up = int(sqrt(n) + 0.5);
	for (int i = 2; i <= up; ++i)
		if (n % i == 0)
			return 0;
	return 1; //本句可按需修改
}

/***************************************************************************
  函数名称：main
  功    能：主程序步骤
  输入参数：无
  返 回 值：无
  说    明：无
***************************************************************************/
int main()
{
	/* main函数不允许任何改动 */
	int n = 0, m;

	for (m = 101; m <= 200; m += 2) { //偶数没必要判断
		if (prime(m)) {
			cout << setw(5) << m;
			n = n + 1;          //计数器，只为了加输出换行
			if (n % 10 == 0)    //每10个数输出一行
				cout << endl;
		}
	}
}
